{
  "place_info": {
    "title": "star clinic istanbul",
    "address": "19 Mayis Caddesi Dr. Hüsnü ismet Öztürk Sokak Sisli Plaza, Cevahir Avm Arkasi, 34360 Şişli/İstanbul, Türkiye",
    "rating": 5,
    "reviews": 8,
    "type": "Hair transplantation clinic"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUR2MnRUZWdBRRAB",
      "name": "asmaa felemban",
      "score": 5,
      "comment": "I am writing to express my sincere gratitude and strong recommendation for Star Clinic. I recently underwent a hair transplant procedure at the clinic, and I am absolutely thrilled with the results.\n\nDr. Demit and her entire team were incredibly professional and skilled. The clinic itself was exceptionally clean and hygienic, and the staff went above and beyond to ensure my comfort and satisfaction. The hair transplant procedure was performed with the utmost care and precision, and the results have exceeded my expectations.\n\nI was particularly impressed with the clinic's commitment to post-procedure follow-up. The staff remained in close contact with me throughout my recovery, providing guidance and support every step of the way.\n\nI would also like to give a special thanks to Maram, who was extremely helpful and accommodating throughout my experience.\n\nI wholeheartedly recommend Star Clinic to anyone considering a hair transplant. Their expertise, professionalism, and dedication to patient care are truly exceptional."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURfZ1l1LTFBRRAB",
      "name": "PartypancakeE",
      "score": 5,
      "comment": "İ had hair transplant surgery with this star clinic , it was beyond my expectations, i can't be more satisfied with the services , amazing staff , clean clinic , thank so much to the doctor and medical team who took really good care of me , i definitely recommend it to everyone, thank you again star clinic istanbul 🙏"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNIdkpEQWRnEAE",
      "name": "Mohamed 9",
      "score": 5,
      "comment": "It’s was wonderful experience with Star clinic istanbul. I had decided that I wanted a hair transplant and I can say that they have very strong and organise management with very skilled, dedicated team members. They looked after me as a friend almost as if I was a family member. Overall I was extremely pleased with the service and I would highly recommend to everyone who are thinking  hair transplant."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnZxUkNnEAE",
      "name": "yasser maher",
      "score": 5,
      "comment": "I would like to express my sincere thanks and appreciation for the excellent service I received at Star Clinic. I have noticed a significant improvement in my health over the past three weeks, and I am very happy with the results.\nI would like to extend my sincere thanks to Dr. Damit and all the medical staff for their sincere efforts and dedication to providing health care. I highly recommend the clinic to anyone looking for quality healthcare\nI would like to thank the medical consultant, Maram, for her dedication to work and quick response before and after the operation, and continuing until now\nThank you, Star Clinic 🤍"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHRuSXdRRRAB",
      "name": "maram jrd",
      "score": 5,
      "comment": "I had an incredible experience this week. I knew they were good from Star Clinic Istanbul, having heard good things about them, but I had confirmation in person. The Doctor was very good as were the other staff collaborators, I have no words... thank you so much ❤️"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURfb1lpU1FREAE",
      "name": "بو رهف",
      "score": 5,
      "comment": "God bears witness to me that their work in agriculture is excellent, and it is enough to treat you with class as if you are one of their family, even after agriculture. They care about the smallest details every day, they follow up on your condition, especially Sister Sarah, God willing, may God make her happy."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURfZ1pxSDFRRRAB",
      "name": "teto .h",
      "score": 5,
      "comment": "The experience, frankly, was very nice, and the treatment was more than wonderful, in terms of attention and cleanliness during the operation and follow-up after the operation, especially from sister Mira. Thanks to her."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURma2FUa21nRRAB",
      "name": "طلال هوسه",
      "score": 5,
      "comment": "Their work is nothing wrong, God willing, may God bless you. I highly recommend it"
    }
  ]
}