{
  "place_info": {
    "title": "Klinike Dentare Duraj Dental",
    "address": "pallati jeshil, Rruga Sami Frasheri Perballe LSI-së, Kati 3 me ashensor , mbi Farmaci Dite Nate, Tiranë 1019, Albania",
    "rating": 4.9,
    "reviews": 58,
    "type": "Dental clinic"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNJMS1IWXBBRRAB",
      "name": "Nina Jones",
      "score": 5,
      "comment": "Absolutely fantastic experience at Klinike Dentare Duraj Dental! Dr. Julian and his team were incredible from the moment I walked in. I had a root canal and two dental implants done, and everything was handled with such care, skill, and attention to detail. I’ll be coming back in three months to complete the implant process, and I genuinely feel confident and well looked after.\n\nThe clinic itself is spotless, modern, and welcoming. What really impressed me was the extra care they took - not only with me, but also with my guest, who received a complimentary deep clean and whitening! Such a thoughtful and generous gesture that really made the whole visit even more memorable.\n\nHuge thanks to Dr. Julian and the team. I left feeling reassured, well cared for, and genuinely impressed by the level of service."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUo2VW5BRRAB",
      "name": "Regiena Guia",
      "score": 5,
      "comment": "\"I had an exceptional experience at this dental clinic! From the moment I walked in, the staff was welcoming, professional, and made me feel comfortable. The dentist goes above and beyond to ensure a painless and efficient visit. The dentist was thorough, explaining every step of the procedure with great care. I highly recommend this clinic to anyone looking for top-notch dental care. Truly a 5-star experience!\""
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURmX08tMzNRRRAB",
      "name": "juli aliaj",
      "score": 5,
      "comment": "Proffesional staff, i felt wellcomed. Quality work and great prices. Fully recommend ✌🏼"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURfb0pXalVBEAE",
      "name": "armela gjana",
      "score": 5,
      "comment": "The best clinic with amazing service and professional, friendly staff. Highly recommend!✨"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNQNEp2bElnEAE",
      "name": "Megi Shehaj",
      "score": 5,
      "comment": "My experience at Klinike Dentare Duraj Dental was very pleasant.\nEveryone makes you feel welcomed and give the confidence that any aspect of dentistry needs can be addressed.\nThey are all patient, professional and dedicated. My complicated front bridge was resolved with great satisfaction, I couldn’t have been in better hands."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNieC02VXlnRRAB",
      "name": "Skendo Havari",
      "score": 5,
      "comment": "Kind staff the doctor is very friendly ! I had my upper teeth done 3 years ago and I am very satisfied with the result! Highly recommend"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURfd0llYzlRRRAB",
      "name": "KEVIN ALIAJ",
      "score": 5,
      "comment": "Best Dental clinic in town! Nice staff awesome work!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNyNHFhbTh3RRAB",
      "name": "Arken Alliaj",
      "score": 5,
      "comment": "Best doctor in town, great service and beautiful clinic. Easy to find in the center of tirana"
    }
  ]
}