{
  "info": {
    "name": "All On Dental Clinic",
    "description": "Discover Your New Smile In Istanbul",
    "longDescription": "All on Dental Clinic Istanbul Turkey is a premier dental facility offering a full range of general and specialist care to both locals and international visitors to this spectacular city overlooking the Bosphorus Strait.\n\nTaking a holistic approach to dental care, All On Dental provides treatments that are good for your mouth and good for your body. The clinic has attracted leading dentists and support staff to create a relaxed yet professional environment for tailor-made dental care that exceeds expectations. \n\n\n\nBy word of mouth from happy patients, the quality of the services at All on Dental has reached far and wide. Simply put, they know which factors count when determining what dental tourists want—and while price is obviously important, trust is normally the pivotal factor when it comes to deciding which facility to go to when abroad. As a result, the clinic has treated thousands of patients from overseas. \n\n\n\nDental Team:\n\n\n\nSpecialists at All On Dental are committed to delivering the ultimate in oral healthcare and cosmetic dentistry. The team includes general dentists, prosthodontists, orthodontists, implantologists and cosmetic dentists, as well as dental hygienists who work together to improve your health and restore your smile.\n\n\n\n- Dr. Ahmet Sinan Cem Çepeloğlu is a highly experienced dentist with 37 years of practice in advanced oral implantology. He is fluent in English, Hungarian, and Turkish, allowing him to communicate effectively with a wide range of patients. As a member of the Turkish Dental Association, Dr. Çepeloğlu is recognized for his expertise in complex implant procedures and his dedication to the field of dentistry.\n\n\n\n- Dr. Abdulkadir Cosguner has 36 years of experience specializing in cosmetic dentistry and implant surgery. A member of the Turkish Dental Association, he is skilled in creating aesthetically pleasing and functional dental solutions. Dr. Cosguner is fluent in English and Turkish, ensuring comprehensive care and communication for both local and international patients.",
    "email": "info@allondental.com",
    "phone": "+905394404530",
    "town": "Istanbul",
    "country": "Turkey"
  },
  "images": [
    {
      "id": "1735311893393-40d6j0a4p",
      "filename": "1735311892773-DSC02762 copy.jpg",
      "originalname": "DSC02762 copy.jpg"
    },
    {
      "id": "1735311893393-n827p0m4k",
      "filename": "1735311892886-DSC02758 copy.jpg",
      "originalname": "DSC02758 copy.jpg"
    },
    {
      "id": "1735311893393-1o1o5dvcz",
      "filename": "1735311892903-DSC02756 copy.jpg",
      "originalname": "DSC02756 copy.jpg"
    },
    {
      "id": "1735311893393-eh7ylfo9f",
      "filename": "1735311892988-DSC02750 copy.jpg",
      "originalname": "DSC02750 copy.jpg"
    },
    {
      "id": "1735311893393-1atek0w97",
      "filename": "1735311893000-7 copy.jpg",
      "originalname": "7 copy.jpg"
    },
    {
      "id": "1735311893393-khouogkpa",
      "filename": "1735311893090-6 copy.jpg",
      "originalname": "6 copy.jpg"
    },
    {
      "id": "1735311893393-z1pvge9vp",
      "filename": "1735311893101-5 copy.jpg",
      "originalname": "5 copy.jpg"
    },
    {
      "id": "1735311893393-ikj6zawjy",
      "filename": "1735311893200-4 copy.jpg",
      "originalname": "4 copy.jpg"
    },
    {
      "id": "1735311893393-oqhp1onkp",
      "filename": "1735311893207-3 copy.jpg",
      "originalname": "3 copy.jpg"
    },
    {
      "id": "1735311893393-yqrvbwvhf",
      "filename": "1735311893289-2 copy.jpg",
      "originalname": "2 copy.jpg"
    },
    {
      "id": "1735311893393-o4ryn2vv4",
      "filename": "1735311893298-1.jpg",
      "originalname": "1.jpg"
    },
    {
      "id": "1735311893393-sa4mnix0v",
      "filename": "1735311893384-1 copy.jpg",
      "originalname": "1 copy.jpg"
    }
  ]
}