{
  "place_info": {
    "title": "All On Dental Clinic Istanbul | Veneers | Zirconium Crowns | Dental Implants | All On 4 Implants | All On 6 Implants",
    "address": "Building No: 165, Merkez, Halaskargazi Cd. Floor: 3, 34381 Şişli/İstanbul, Türkiye",
    "rating": 4.8,
    "reviews": 257,
    "type": "Cosmetic dentist"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTURvaDdiSzNBRRAB",
      "name": "Gerda Ance Rieksta",
      "score": 5,
      "comment": "I had a really good experience at this clinic. I was a bit worried at first since the dental market in Turkey is so oversaturated, but after doing some research, I decided to go with this place — and I’m really glad I did.\n\nThe communication was smooth and everything was easy to understand. The staff were friendly, professional, and very helpful. They were also flexible with my travel dates, which made planning much easier.\n\nI went in for a dental implant that cost $270 — and there were no hidden fees. That price included the consultation, X-ray, the implant screw, and antibiotics afterward. I only paid extra for a cleaning, which I chose to do as an additional treatment.\n\nThe procedure itself was super quick — the implant screw was in within about 15 minutes. I was nervous because of past experiences elsewhere, but this time there was no swelling, no pain during or after the procedure, and I felt completely fine the next day.\n\nI’ll be returning in 3 months to get the crown placed, and I’ll definitely choose this clinic again. Highly recommend to anyone looking for quality dental care at a fair price!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUR3ck0yX2FnEAE",
      "name": "Om Thakker",
      "score": 5,
      "comment": "★★★★★ 5/5\nEmre and his team are incredible! As my dental advisor, Emre provided exceptional professional service from start to finish. The pre-service care was thorough and reassuring, and the post-service follow-up was just as impressive—my teeth look amazing now! The team’s friendly approach and skill made everything easy, and the ease of payment was a huge plus. I’d give them 6 stars if I could! Highly recommend!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUR3LTlDVktnEAE",
      "name": "yeckaplice",
      "score": 5,
      "comment": "UK bigotry towards 'Turkish teeth' is appalling. I've seen nothing but professionalism in All on Dental. I'm writing this review just because I don't feel like the prejudice towards Turkish dental industry is at all just. Make sure you read your reviews and check certificates and you'll be absolutely fine.\n\nThe communication was very clear and prompt from when I inquired about the treatment over WhatsApp and it remained this way throughout.\n\nWhen we arrived at the clinic, everyone spoke perfect English, was very polite and we talked at length about what were about to do after the x-ray.\n\nNot for a moment did I feel uncomfortable. I was explained everything thoroughly and I was informed of every step.\n\nThe process itself was very quick, I reckon it took less time than actually discussing the work to be done.\n\nMy implants are healing nicely, I've been given antibiotics and other medication to control the healing process, and so far I've not experienced any issues.\n\nAfter extraction of one tooth, the doctor discovered that there was too much infection underneath and didn't put an implant there and offered to either return the money of put it towards the next visit. He saw that there was a possibility of that when looking at the x-ray before beginning the work.\n\nNot only that no one offered any unnecessary services to me, but they refused to do a replacement of a discoloured composite veneer due to lack of integrity of the tooth, the doctors said that it won't last and it'll chip. A less respectable doctor would do it but they saw that it'll create problems later on.\n\nAll in all, All on dental are as trustworthy and reliable as it can possibly be, and I look forward to my next visit."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNMOE1fVnFnRRAB",
      "name": "Ella Amirova",
      "score": 5,
      "comment": "I'm really pleased with this place !\nIt was recommended by a friend.\nThis Clinic is very nice and clean, The team is very friendly, but most importantly I like the doctor (Kadir) . He seems very experienced, he was asking how my teeth feels, various times, and anything that was feeling uncomfortable he fixed right away.\nAlso the translator Merve, she was very nice, clear, patient and understanding with me!\nAlso transportation and the hotel was great, I now can also recommend this place and especially doctor Kadir!!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUNJM3MzUEpnEAE",
      "name": "Silvia Carenzi",
      "score": 5,
      "comment": "Although I’m based in Italy, I regularly travel to Istanbul — and every time I visit, I make sure to go to the ‘All On Dental Clinic’. The staff is amazing; the services they offer are great. Plus, the prices are very good. They offer five-star treatments — highly recommended! 👏🏼"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUMzNjkzWUh3EAE",
      "name": "Ian Cousins",
      "score": 5,
      "comment": "I have been to all on dental a couple of times and every time I have been treated with warmth and professionalism.  There crowns are the best in the business in my opinion for natural shape and colour.\n\nThey are super efficient with transportation and treatment times with the help of Emre and Hafia.\n\nI would recommend to all who are thinking of getting dental services from All on dental.\n\nI would like to give a special mention to two people, firstly, Emre who went out of the way to make my experience special with guidance on local tourism information and places to dine.\n\nSecondly Bozo who is like a brother, he treats you like you are family and has helped me not only with my experience with aftercare due to having to come back for a small issue but also issues of my health e.g. hair transplant, he gave me time and a great amount of support of what to expect and who to trust, which he didn't have to. So for that I am hugely grateful for.\n\nMy smile is now beyond my expectations and I am planning to bring my wife here shortly to have her smile designed"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURyenRDd0FnEAE",
      "name": "Georgina McMullen",
      "score": 5,
      "comment": "Could not recommend enough! From the very beginning the team at All On Dental made me feel safe and heard. They understood the aesthetic I wanted to achieve for my teeth and understood my previous dental work. They worked hard and fast on completing my treatment and also looked after me post-treatment.\nThey completed x-rays on me and dental cleaning before starting any of the dental work. They redid any of the work I wasn’t completely satisfied with. And even now, 2 weeks post-treatment, they still contact me asking me how I am/how I’m feeling, etc.\n\nAlso, something to bear in mind. Even tho the dental clinic is easy to get to and is very central. Finding the clinic might be quite hard. It’s on a main road which is ideal but it’s not sign posted. Once you find the building, even if it doesn’t look like a dentist practice, just go inside and go to the 3rd floor :)"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aGF6SFB3EAE",
      "name": "Merve Sağlam",
      "score": 5,
      "comment": "I had the chance to work with All On Dental Clinic and it was one of the most enriching, dynamic experiences of my professional journey. In an international environment, I discovered a welcoming and highly professional team that share their knowledge with passion. I highly recommend All On Dental to anyone seeking quality dental treatment and care. I also recommended the clinic to anyone looking to grow in an international and professional setting.\nIt was a pleasure to collaborate with you, thank you All On Dental 🦷💚"
    }
  ]
}