{
  "place_info": {
    "title": "Vive Dental",
    "address": "Petro Nini Luarasi, Tiranë, Albania",
    "rating": 5,
    "reviews": 33,
    "type": "Dental clinic"
  },
  "reviews": [
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUN3MzlydmNnEAE",
      "name": "Iva Kapoli",
      "score": 5,
      "comment": "I had a facial treatment at Vive Dental and I’m so impressed! The staff were professional, friendly, and made me feel comfortable throughout the process. My skin feels smoother, brighter, and looks amazing. The results exceeded my expectations, and I’m definitely coming back for more treatments. Highly recommend!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURfd002UUxREAE",
      "name": "Sidueta Smajlaj",
      "score": 5,
      "comment": "Excellent experience! I’ve been to many dentists over the years,but after visiting this office I’ve definitely found the right place for me. Friendly and extremely knowledgeable and professional team, they made me feel at ease the moment I walked in. Dr. Anila was very caring and helpful with my treatment. She walked me through every step and made sure I was comfortable. The office is very clean which to me is very important.\nHighly recommended!!!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURmdGVUR0V3EAE",
      "name": "Enjan Smajli",
      "score": 5,
      "comment": "Exemplary service! The whole team are friendly, professional, caring and efficient in their delivery of a top class service.\nEach process was clearly explained, making you feel at ease. Highly recommended"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURmMjUzblNBEAE",
      "name": "Iva Rushit",
      "score": 5,
      "comment": "\"I recently visited “Vive Dental Clinic” and I’m so impressed! The clinic is brand new, clean, and modern. The staff is friendly, and Dr. Anila made me feel comfortable and explained everything clearly. It’s great to have such a professional dental office in the area. Highly recommend checking it out ! I’m extremely satisfied with the service I received and will definitely be coming back for all my future dental needs."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNJczczcDZRRRAB",
      "name": "Enid Lohja",
      "score": 5,
      "comment": "Great customer service, a very welcoming supporting staff and amazingly professional and capable doctors. Great overall experience"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURmNGVQTklBEAE",
      "name": "Natasha Maci",
      "score": 5,
      "comment": "Highly skilled doctors who did the treatment with  care and empathy. Highly recommended!!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUR3bkthVmt3RRAB",
      "name": "Fatos Kaleshi",
      "score": 5,
      "comment": "Excellent services, exceptional start."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURmcmN1a293RRAB",
      "name": "blerina lleshaj",
      "score": 5,
      "comment": "Highly recommended clinic!"
    }
  ]
}