{
  "place_info": {
    "title": "Radiance Dental Hospital - Turismo Dentale in Albania",
    "address": "Rruga Ismail Qemali 27, Tiranë 1001, Albania",
    "rating": 5,
    "reviews": 149,
    "type": "Dental clinic"
  },
  "reviews": [
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURGbGFLaEJ3EAE",
      "name": "Besnik Dalliu",
      "score": 5.0,
      "comment": "Very good servis dhe friendly staff. I appreciate the staff's dedication when i was there. Very good dental clinic."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUN4bjVxMjN3RRAB",
      "name": "Enian Tafa",
      "score": 5.0,
      "comment": "Very professional and skilled. Every person I met in their office was courteous friendly and professional.\nCannot recommend them more highly."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNwMDZpZjhnRRAB",
      "name": "Suarda Ismaili",
      "score": 5.0,
      "comment": "It was the best clinic I found around, the prices were affordable and the service was ten out of ten 🙂"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURGMjQ3UTBnRRAB",
      "name": "Barrikada Football Club",
      "score": 5.0,
      "comment": "One of the most qualified offices in the market. Professional and very friendly."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNwbzhDSy1RRRAB",
      "name": "Suela Kurti",
      "score": 5.0,
      "comment": "Fantastic service and a friendly team\nThe cheapest prices and the best quality 👌 👏"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNwazg3aTFBRRAB",
      "name": "Klediana Qazimi",
      "score": 5.0,
      "comment": "Very professional"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNveUo2U3RnRRAB",
      "name": "Luciana Siddi",
      "score": 5.0,
      "comment": "I am really happy I chose this dental clinic! The environment is modern, clean and welcoming, and all the staff are extremely professional and kind. I immediately felt at ease, which is not at all a given when talking about a dentist!\nThe doctor explained each step with clarity and patience, answering all my questions. The treatment was quick, painless and with an impeccable result.\nPost-intervention was also followed with great attention.\nI highly recommend this clinic to anyone looking for a serious, reliable service with a human touch. I couldn't be more satisfied!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNvMllXQ3RnRRAB",
      "name": "cheikh thiam",
      "score": 5.0,
      "comment": "I highly recommend this dental studio! The team is professional, warm and always attentive. The setting is clean, modern and very reassuring. The care is quality, with real attention to detail and patient comfort. Thank you for your welcome and your seriousness!\nI was very well received at the studio. The dentist took the time to explain each step and was very gentle during the treatment. The equipment is of the latest generation, and the hygiene is impeccable."
    }
  ]
}
