{
  "place_info": {
    "title": "DentaRay Clinic",
    "address": "Teşvikiye, Güzelbahçe Sk. No:21, 34365 Şişli/İstanbul, Türkiye",
    "rating": 4.9,
    "reviews": 237,
    "type": "Dental clinic"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNnc296a2hnRRAB",
      "name": "SrIgarek Z",
      "score": 5,
      "comment": "I recently had an amazing experience at DentaRay Clinic with Dr. Ahmet and Dr. Mehmet, along with Shafa, the Turkish-to-Russian translator who assisted me throughout the process. I had 10 crowns, 6 fillings, and professional laser teeth whitening done, and I must say—I am beyond impressed with the quality of work and attention to detail.\n\nFrom the beginning, I made it clear that I wanted to preserve my natural teeth as much as possible and achieve a natural-looking smile. The doctors truly listened to my wishes and worked with incredible precision to ensure that my teeth looked both beautiful and natural. They did not stop until I was completely satisfied, and their dedication to perfection really shows in the results.\n\nIn addition to the outstanding work of Dr. Ahmet and Dr. Mehmet, I also want to acknowledge the amazing assistants who supported them throughout the process. Their skill and professionalism made the entire experience smooth and efficient. The entire staff at DentaRay Clinic was incredibly kind and friendly, making me feel comfortable and well cared for from start to finish.\n\nIf you’re looking for top-tier dental care with a focus on preserving a natural look, I highly recommend DentaRay Clinic. Thank you, Dr. Ahmet, Dr. Mehmet, Shafa, and the entire team for an outstanding experience!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTURJNW9DUlh3EAE",
      "name": "Rob",
      "score": 5,
      "comment": "Best experience I’ve ever had! Came from Canada to Istanbul and it was amazing visit, staff were friendly and very professional. Can’t say enough, be back soon for my full experience."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUQzOU0yY2pRRRAB",
      "name": "Abu Farooq",
      "score": 5,
      "comment": "In recognition of the outstanding work done on my dental implant procedures, it has given me a beautiful smile and a renewed sense of confidence. The kindness, professionalism, and warm approach of the entire team has exceeded all expectations. Each team member has shown exceptional care, creating a welcoming experience throughout my journey with them.\n\nI would highly recommend Denta Ray Clinic to anyone considering visiting Istanbul, Turkey, for dental treatment. Their expertise and dedication to patient care truly sets them apart."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTURnN2VQNGlBRRAB",
      "name": "Qudsia Malik",
      "score": 5,
      "comment": "The whole team make you feel as a family member and treat with respect and value our opinion and advise accordingly."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNUNnYzLUpnEAE",
      "name": "Abdallah Otoom",
      "score": 5,
      "comment": "I traveled all the way from Germany to Dentaray Clinic and it was worth every mile. The team is welcoming and the dental care is top-notch. I’m very pleased with the dental work and the overall service. A big thanks to everyone, especially the patient coordinators!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNBbUt5X3RRRRAB",
      "name": "Mohamad Bastoni",
      "score": 5,
      "comment": "I had the best experience at DentaRay Clinic, I used to have a bad teeth conditions and right now my smile is perfect.\nHighly recommend!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dFp2QjdBRRAB",
      "name": "Aiden Blackmoore",
      "score": 5,
      "comment": "I really recommend Denta Ray for your dental problems.\nAnd also come see Mufida,  Ibrahim fo translation.  see Dr  Laith for you implants he will be with you from your implants day  to the day you have your denture completed, and Dr Mervi for your denture. I have never seen any one like her. 2 impressions and the 3rd your denture is ready to go.\nShe is the best I have ever delt with for my denture.\nSaad, is the man you need to be in contact with. He was very honest from day one. He told me about the price and all the procedures you are going to need. He really fulfilled all my needs about the trip and he will be with you to day you leave Istanbul.\nI give them 5 stars for sure without any questions."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNOaUtuZU13EAE",
      "name": "Aa No",
      "score": 5,
      "comment": "Hi\nIm very pleased with all dental work was done by DentaRay Clinic. Best doctors I have ever seen.i look young again. Many thanks to Dr. Ahmed and Dr. Merve   ..Also thanks for the coordination of Mr. Ibrahim and Saad , you guys are amazing..  I recommend this clinic to everyone. Thanks all"
    }
  ]
}