{
  "doctors": [
    {
      "id": "1747893020140-zdj9x78c8",
      "name": " Dr. Suzana Bigava Maršić",
      "title": "Dr",
      "licenseNumber": "66434243",
      "biography": "r. Suzana Bigava Maršić was born on May 19, 1969 in Sydney, Australia, where she completed high school. \r\n\r\nIn 1988/1989, she enrolled in Dentistry at the Faculty of Dentistry in Zagreb, where she graduated in 1994. In September 1994, she started working in the public health sector in Split, Croatia, where she was active until 1997. After working in the public sector, she opened her own private dental practice.\r\n\r\nShe completed her education at the London Intelligent Alignment Systems Academy, where she completed the Inman Aligner Hands on Certification Course and disorders of the temporomandibular joint with functional diagnostics and functional therapy, where she earned an APW certificate (Akademie Praxis und Wissenschaft bei DGZMK).\r\n\r\nShe gives special emphasis to fixed orthodontics, and Damon completed her masters under the guidance of Dr. Perera Grau and Dr. Garcia Espejo from Madrid.\r\n\r\nHe believes in continuous education. He is a collaborator in education and professional training in collaboration with the Faculty of Dentistry in Split and the Dental Center Marušić High School in Split. He is an advocate of preventive and minimal intervention.\r\n\r\nHer goal is to improve and maintain natural teeth for a lifetime. Since every person is unique, and every mouth is unique, she develops individual plans for each patient with this in mind. \r\n\r\n\r\nDr. Suzana Bigava Maršić uses the latest dental technology to design customized, beautiful smiles and fulfills the wishes of each of her patients individually. \r\n\r\nShe is an active member of the Croatian Dental Chamber. ",
      "yearsActive": null,
      "activeSince": null,
      "specialties": [],
      "languages": [],
      "image": "1747893020074-doctora_bigava.png",
      "createdAt": "2025-05-22T05:50:20.140Z"
    }
  ]
}