{
  "place_info": {
    "title": "Dental Practice Dr. Susan Bigava Maršić",
    "address": "Slobode ul. 2B, 21000, Split, Croatia",
    "rating": 4.9,
    "reviews": 85,
    "type": "Cosmetic dentist"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURfaDlUU3hBRRAB",
      "name": "Rayko Chopich",
      "score": 5.0,
      "comment": "From my very first interaction with the wonderful Dr. Susan, I felt an overwhelming sense of comfort and care that continued throughout my entire experience. She has a remarkable ability to put you at ease, making even the most anxious patient feel relaxed. If dental visits fill you with fear, I can't recommend Dr. Susan enough—she truly is a beacon of hope in that regard. Her skill and dedication are truly impressive, and the entire staff is equally compassionate and supportive. Thanks to her, I'm able to smile again with confidence.💪❤️🤗"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURIaTlUV1ZREAE",
      "name": "Liza B",
      "score": 5.0,
      "comment": "I would highly recommend Dr. Bigava clinic, from very beginning Dr.Bigava answered all my questions via email and managed to make an appointment for me when I am on holiday in Croatia. My dentist in Glasgow tried to extract the tooth but failed, because the molar cracked and I was left literally with only two infected roots. I was told that I would need a surgical extraction and was put on a long waiting list. However, when I arrived to Dr. Bigava clinic, Marco assured me that I might not need a surgical procedure and he extracted both roots within 15 min, no cuts, no stitches, true professional. And now it is the third day after my extraction, I have minimal pain, minimal swelling and feel absolutely great!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURIamJlOWlBRRAB",
      "name": "Kitti B",
      "score": 5.0,
      "comment": "Dr Susan our dentist is incredibly friendly, professional, and caring. We always felt welcomed and well taken care of. She takes the time to explain each step of the procedure and answered all of my questions with patience and expertise. I would highly recommend this dentistry."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNId1lEU1p3EAE",
      "name": "Евгений Шафранов",
      "score": 5.0,
      "comment": "About a year ago I moved to Split and was looking for a clinic to proceed with my ongoing orthodontic treatment. My case was somewhat unusual, by that time I had missed several scheduled appointments with my regular doctor already, and Dr. Susana was the only one in the city who agreed to take me in.\nShe examined my current situation and presented me with a treatment plan, which included correction of the mistakes made by my previous doctor. Everything went smoothly, she would always answer all of my questions and keep me updated on the progress.\nDuring the treatment I also required replacement of existing fillings, that was when Marko stepped in and done the perfect job.\nTina and Jelena were always there for me as well to help with everything from assistance during appointments to managing my visits.\nI have always felt that people in this clinic love what they do, being true professionals, they deeply care about the comfort and health of the patients.\nA year flew by, I am now a happy owner of a perfect smile full of healthy teeth (you can check it out for yourself on their Instagram).\nAs for the clinic itself, it's very clean, well-kept and packed with modern equipment.\nLook no further."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUM3N0ltWEl3EAE",
      "name": "Salva Aparicio",
      "score": 5.0,
      "comment": "During my holidays in Croatia I needed to visit urgently a Dental Clinic due to acute pain in teeth.\n\nDr. Susan Bigava Marsic's dental clinic is truly exceptional. From the moment I walked through the door, I was greeted by a warm and friendly staff who made me feel comfortable and at ease.\n\nThe clinic itself is clean, modern, and well equipped, which immediately gave me confidence in the level of care I would receive.\n\nThey took the time to thoroughly explain each step of the dental procedure I needed, ensuring that I understood the process and felt comfortable throughout.\n\nTheir attention to detail and gentle approach made the entire experience virtually painless (Tooth extraction)\n\nEasy communication in very good English.\n\nI highly recommend Dental Clinic Dr. Susan Bigava Marsic."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURyd0pQbC1nRRAB",
      "name": "Aleksandar Talic",
      "score": 5.0,
      "comment": "It's the best dentist out there!\nThey managed to make the appointment the same day, and I am truly amazed how lovely, professional, and knowledgeable the whole team is! Real professionals!\nThey all speak perfect English, and the approach and equipment are top-notch. I will definitely be back when I am in Split and would highly recommend Dr. Susan. Thank you!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNka0lYQ1RnEAE",
      "name": "Stephen Vukas",
      "score": 5.0,
      "comment": "My wife and I had exceptional experiences at Susan's office. Marko provided outstanding care, taking the time to address all our questions and making sure we had as pain-free experience as possible during our procedures. He skillfully identified and repaired an issue with my wife's tooth, a consequence of previous work done in the United States. The confidence in the quality of care led me to schedule additional work. The positive and light atmosphere in the office adds comfort to what is typically not a pleasurable experience. Highly recommend this dental practice!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNabFpmOENBEAE",
      "name": "Ágnes Nagy",
      "score": 5.0,
      "comment": "The most exceptional dental practice I’ve ever visited. I chose this place based on the reviews, and I can see why people talk about this practice and Dr Suzana so highly. She is so professional and unbelievably accommodating. I visited her during my holiday and she booked my appointments to fit around my holiday plans. She and Dr Darija didn’t only complete the jobs I was hoping to get done, but they’ve resolved all the issues I had, including saving a tooth that every other dentists thought would need to be removed at one point. Dr Suzana left me absolutely speechless with the result. The attention to detail of both Dr Suzana and Dr Darija is outstanding. Besides all this, the atmosphere at the practice is like at no other place. The music is on, the team members chat and laugh, it’s really so friendly that it helped me stay relaxed throughout. I’m very grateful and I would definitely recommend this dental practice to everyone. I don’t live in Croatia, but even I will consider coming back if I need help in the future."
    }
  ]
}
