{
  "info": {
    "name": "Polyclinic Dr. Gikić ",
    "email": "vip@poliklinikagikic.hr",
    "phone": " 099/3631 630",
    "address": "Ozaljska 128\n10000 Zagreb\nCroatia",
    "description": "The Gikić Dental Clinic specializes in smile reconstruction, short-term repair of one or both jaws on implants or natural teeth.\n\nA narrow circle of specialists for the MOST DIFFICULT oral surgical and prosthetic procedures according to modern protocols.\n\nreconstruction on existing teeth – Digital Smile Design: veneers, crowns, bridges\nImplant reconstruction – All on 4 / Zygoma : fixed teeth on implants (which are not removed from the mouth).",
    "longDescription": "The Gikić Dental Clinic has been operating continuously at the same address in Trešnjevka, Ozaljska 128, since 1979 , when Dr. Danko Gikić founded his private practice. After graduating from the Faculty of Dentistry, University of Zagreb, in 2007, his son, Dr. Matija Gikić, joined him.\n\nHe continued on the well-trodden path, but also introduced modern methods and digital technology into practice, keeping pace with the latest developments in dental medicine. Today, the clinic is recognized as one of the leading dental institutions for \"full arch\" therapy , i.e. functional and aesthetic reconstruction of one or both jaws in a short time .   Experience and tradition for more than 40 years at the same address!\nThe specialties of the polyclinic that have been passed down from generation to generation are oral surgery and dental implantology .       Numerous diplomas and certificates confirm the quality of our work. We are grateful to our long-standing loyal patients who place their trust in us.\nOver 80% of patients come to us on recommendation, which is the best promotion of the clinic's work.\n\nDSD – Digital Smile Design implies a protocol in which all processes in the office and laboratory are digitized for HIGHER QUALITY, PRECISION OF PRODUCTION, PREDICTABILITY OF RESULTS AND SAVING TIME. The biggest advantage of DSD for patients is the possibility to see their new smile in advance, before the start of the therapy itself ( Test drive your smile / You can trail your future smile )  , so that they can give their opinion and thus actively participate in the creation of their new smile."
  },
  "images": [
    {
      "id": "1747805734657-yl5oi7b5t",
      "filename": "1747805734462-poliklinik_7.png",
      "originalname": "poliklinik 7.png"
    },
    {
      "id": "1747805734657-mwh4dluhm",
      "filename": "1747805734583-poliklinik_5.png",
      "originalname": "poliklinik 5.png"
    },
    {
      "id": "1747805734657-kepjy6jrh",
      "filename": "1747805734629-poloklinik_2.png",
      "originalname": "poloklinik 2.png"
    },
    {
      "id": "1747805734657-a3zo5huv9",
      "filename": "1747805734637-poliklinic.png",
      "originalname": "poliklinic.png"
    },
    {
      "id": "1747805764009-kgqlkjw4c",
      "filename": "1747805763841-poloklinik_8.png",
      "originalname": "poloklinik 8.png"
    }
  ]
}