{
  "info": {
    "name": "Dentgen Oral and Dental Health Center",
    "email": "info@dentgen.clinic",
    "phone": "+90 537 330 51 14",
    "address": "Şerifali, Miras Sk. No: 20, 34775 Ümraniye/İstanbul\nTurkey",
    "description": " ",
    "longDescription": " DentGEN, which aims to inspire and lead in the field of oral and dental health, has taken its place among the important center of Ataşehir, Istanbul. Our center, which is easily accessible for our patients coming from outside Istanbul, is located 15 minutes away from Sabiha Gökçen Airport, and 20 minutes away from Kadıköy and Üsküdar. All procedures of our patients can be carried out in a single center, and services are provided in all branches of Dentistry\n\nMission\nAt DentGEN, our mission is to achieve excellence in dental and oral health services on an international level by providing our patients with the most current treatment methods. Our highest priority is ensuring that every individual attains a healthy smile through our stringent quality, aesthetic, and hygiene standards. By offering personalized and compassionate care to patients from diverse cultural backgrounds, we aim to be a reliable guide on their health journey.\n\nVision\nDentGEN aims to be a pioneering institution in the field of dental and oral health, distinguished by its innovative treatment methods and commitment to continuous improvement. Our vision is to become an inspiring leader in the sector, closely following technological and scientific advancements, and offering sustainable health solutions. We strive to maintain the highest levels of patient satisfaction and trust, aspiring to be a globally recognized and preferred healthcare institution.\n\n\nEthical Principles and Values\nDentGEN adheres to the highest ethical standards in its operations, providing services to our patients based on respect, honesty, and transparency. As an environmentally conscious institution, we prioritize sustainability and social responsibility projects. Our human-centered service approach focuses on delivering tailored solutions to meet the needs of each patient, contributing to their health and happiness. Our values emphasize continuous learning, innovation, and benefiting the community."
  }
}