{
  "place_info": {
    "title": "Miray Clinic",
    "address": "Yenibosna Merkez, 29 Ekim Cd. no: 19 A, 34180, 34180 Bahçelievler/İstanbul, Türkiye",
    "rating": 5,
    "reviews": 46,
    "type": "Dental clinic"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNfMlpIWTNRRRAB",
      "name": "fatumata sheriff",
      "score": 5.0,
      "comment": "Thank you so much for Miray clinic I’m just having my teeth done. I really appreciate The team was so nice and the doctor also the place very clean and comfortable they offered me transportation , medicines the results of the crowns was so nice I’ve done also implants before 3 months I had no problem they’re very professional and kind\nThank you so much\nI’ll come back soon for another procedure"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURIeVlDN0VREAE",
      "name": "Charlotte Paige",
      "score": 5.0,
      "comment": "So I use Miray clinic for breast enlargement in Turkey.\nThey are an amazing company and I would definitely recommend them to my friends and anyone else reading this review I contacted them through WhatsApp and they are really friendly and they don’t put pressure on yourself to go with themselves and they don’t ask for a deposit and you only pay after you have seen your surgeon and happy with everything\nI was so happy with my results and they have done an amazing job for me and I would definitely use them again for more surgeries"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUR4bE8tdmlnRRAB",
      "name": "Mohamed Ali",
      "score": 5.0,
      "comment": "If you're looking for a dental clinic that prioritizes patient comfort and satisfaction, look no further. The staff at Miray clinic is attentive and caring. They take the time to address any concerns and ensure that you're comfortable throughout your visit. The quality of dental work is top-notch.\""
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUR4dE16akpnEAE",
      "name": "Abdelrahman Moursi",
      "score": 5.0,
      "comment": "The level of care I received at this dental clinic was outstanding. The dentist took the time to listen to my concerns and provided personalized treatment options. The staff was friendly, and the appointment scheduling was convenient. I'm incredibly satisfied with the results of my dental work."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUR4dEpmcE5BEAE",
      "name": "A _hmh",
      "score": 5.0,
      "comment": "I highly recommend this dental clinic. The hygienist did a thorough job with my cleaning, and the dentist was gentle and attentive during my examination. The clinic itself was clean and well-maintained, and the entire staff was friendly and professional. I'll definitely be returning for my future dental needs.\""
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUR4N055T2tnRRAB",
      "name": "Mohand Sul",
      "score": 5.0,
      "comment": "Dr ahmed and the staff are awesome. Every time any member of my family goes to Miray clinic , they get the best possible care. My wife and daughter both got braces at Miray clinic and the results are remarkable. I highly recommend Miray clinic"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUR4bk9hYjlRRRAB",
      "name": "Afraa Faisal",
      "score": 5.0,
      "comment": "I had the best experience everything was well organized and the doctor was really good i had Root Canal Treatment in 3 in two sessions and the doctor explained to me every step that he did\nPlus the price was so affordable compared to the amazing service and hospitality\nOverall 10\\10 and I would highly recommend it to anyone I know."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUR4dE1TVnhRRRAB",
      "name": "Ayman Shoosh",
      "score": 5.0,
      "comment": "I've been a patient at this dental clinic for weeks, and I couldn't be happier with the service I've received. The hygienists are thorough, and the dentists are skilled and compassionate. They have state-of-the-art equipment and stay up-to-date with the latest advancements in dental care.\""
    }
  ]
}
