{
  "place_info": {
    "title": "Visitandmedcare",
    "address": "TERRACE FULYA CENTER, Teşvikiye Mah. Hakkı Yeten Cad, Fulya Sk. No: 11, 34365 Şişli/İstanbul, Türkiye",
    "rating": 4.8,
    "reviews": 74,
    "type": "Community health centre"
  },
  "reviews": [
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNKdTRmYVdBEAE",
      "name": "furkan uysal",
      "score": 5.0,
      "comment": "I recently had the pleasure of being a patient at Visit and Medcare, and I cannot express enough how impressed I am with the level of care and professionalism I experienced. From the moment I walked through the doors, I knew I was in good hands.\n\nThe staff at Visit and Medcare is truly outstanding. Every member of the team, from the receptionists to the doctors, nurses, and support staff, treated me with the utmost respect and kindness. They were always available to address my concerns and made me feel comfortable throughout my entire journey."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURDMFlpeDlBRRAB",
      "name": "alicia knox",
      "score": 5.0,
      "comment": "I had a breast uplift and my doctor ‘dr key’ was amazing and so supportive through Out the whole procedure, anything I needed he was my first point of call. My surgeon was also so professional and meticulous the results from the op are amazing now 5weeks later. The hotels I stayed in were very clean and beautiful inside too. my stay was supposed to be for 6 nights with the package but because I loved it so much I stayed for 15days in total. Thank you For the most pleasant positive experience and the aftercare I recieved during and after my trip to Istanbul X"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNDOC1qaGRBEAE",
      "name": "alemitechserv",
      "score": 5.0,
      "comment": "The best medical solutions and that’s not all. Hospitality is one of the strongest qualities of the people who are in charge and this makes your trip to Istanbul become a holiday full of beautiful memories.\nFirst quality results for every problem.\nProud and happy to have had the chance to meet them"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURDOHYtX1BBEAE",
      "name": "Nora Rj",
      "score": 5.0,
      "comment": "I have to say that my experience with the Dr Key was amazing! He assisted my entirely from A to Z! I have no word to describe how happy I am. I recommend 100% his services and would like to thank you again for everything!!! Xx"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURDMGZEMWRREAE",
      "name": "Samantha T",
      "score": 5.0,
      "comment": "I’ve been back from Istanbul for a month now after my breast augmentation with Visit and Medcare and used Doctor Sever Abi. Everything was so perfect from start to finish, so friendly, helpful and reassuring. Amazing communication from the start which is why I chose them. No complications at all and I am so happy with my results! Would 100% recommend and go back for any other work in future. Thanks Visit and Medcare! 😍"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURjaHJ1RU9REAE",
      "name": "Andreea Tuarec",
      "score": 5.0,
      "comment": "Visitandmedcare didn’t only provided high quality treatments, but also made sure nothing is missing during my stay. They’re amazing! Thank you so much for everything! I will consider you like my family due to the care I received. 🥰"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURjLXBTR05BEAE",
      "name": "Charlie Hodgson",
      "score": 5.0,
      "comment": "Visit and Medcare provide the highest level of care. Attentive to every need and detail and make the whole process of arranging medical treatment so much easier. A very reliable and trustworthy service that always put the client first. I recommend them very highly. You will not be disappointed!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNCcjVpMTdnRRAB",
      "name": "Gökçe Elif",
      "score": 5.0,
      "comment": "Hello , first I want to thank to all team to support me from start to the end of my medical journey and beyond. I see the kindness and hospitality here feel as my second home. Thank you so much Dr Key and @visitandmedcare"
    }
  ]
}
