{
  "info": {
    "name": "Grand Ünal Hotel",
    "email": "info@grandunalhotel.com",
    "phone": "+90 (546) 526 02 02",
    "address": "Katip Kasım, Katip Kasım Mahallesi, Gazi Mustafa Kemal Pasa caddesi, Fabrika Sk. No:10-12, 34130 Fatih/İstanbul",
    "town": "Istanbul",
    "country": "Turkey",
    "starRating": "4",
    "description": "Grand Ünal Hotel offers an unforgettable",
    "longDescription": "Located in the heart of Istanbul's historic peninsul\nGrand Ünal Hotel offers an unforgettable accommodation experience by combining modern comfort with historical richness. Situated in Yenikapı, our hotel features 86 rooms and is within walking distance of the city's most significant tourist attractions.\nCentral Location\nGrand Ünal Hotel is ideally located for those wishing to explore Istanbul's historical and cultural treasures. From our hotel, you can easily walk to iconic landmarks such as the Sultanahmet Mosque, Hagia Sophia, Grand Bazaar, and Basilica Cistern. Additionally, our hotel is within walking distance of the metro, providing convenient access to the city.\n\nModern Comfort\nOur hotel has been designed with your comfort in mind. Our modern and elegantly decorated rooms are equipped with free Wi-Fi, air conditioning, flat-screen TVs, and minibars. With 24-hour room service and daily housekeeping, your comfort and satisfaction are our top priorities.\n\nClose to Shopping Centers\nGrand Ünal Hotel is also ideal for shopping enthusiasts. Our hotel is very close to the city's most popular shopping centers and stores, making it easy for our guests to meet their needs.\n\nUnforgettable Experiences\nWhether you are in Istanbul for business or leisure, Grand Ünal Hotel offers you a peaceful, comfortable, and enjoyable stay. With the enchanting view of the Marmara Sea, you can experience the city's historical texture and modern life together.\n\nWe look forward to welcoming you to Grand Ünal Hotel.\n\nHotel & Suites\nSPA & GYM\nFood & Restaurants",
    "facilities": [
      "Hotel & Suites",
      "Food & Restaurants",
      "SPA & GYM"
    ]
  }
}