{
  "place_info": {
    "title": "Best Dentist In Turkey | Dr. Cem Baysal",
    "address": "Teşvikiye, Hacı Emin Efendi Sk. No:64, 34365 Şişli/İstanbul, Türkiye",
    "rating": 4.7,
    "reviews": 151,
    "type": "Dentist"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTURvcF9TX19nRRAB",
      "name": "Mustafa Saribudak",
      "score": 5.0,
      "comment": "Truly Exceptional Implant Experience in Istanbul, Turkey!\nI recently had a complete dental implant treatment in Istanbul, and I cannot speak highly enough about my experience with Dr. Cem Baysal and the entire team. From the very first consultation to the final follow-up, everything was handled with the utmost professionalism, care, and attention to detail.\nBefore I decided to have him as my doctor, I did research more than a year here in the USA and Turkey for the right dentist. Due to its excessive implant cost in the United States, I focused on four implant dentists in Turkey. After carefully reviewing their websites and their interactions with me I chose Dr Baysal without any hesitation.\nDr. Baysal is not only incredibly skilled but also genuinely caring, and he is very innovative and passionate. He took the time to explain every step of the procedure, answered all my questions with patience, and made sure I felt comfortable and confident throughout the entire process. The clinic itself was spotless, modern, and equipped with state-of-the-art technology—truly on par with (or better than) any top-tier clinic around the world.\nThe results have been life changing. My implants look and feel completely natural, and I can smile, eat, and speak with confidence again. My dentist and hygienist  here in Austin, Texas expressed great comments about my implant. If you are considering dental implants in Turkey, I wholeheartedly recommend Dr. Baysal. His expertise, hospitality, and commitment to patient satisfaction are truly world-class.  I am truly proud of him!   Thank you again for everything—you’ve given me more than just a new smile; you’ve given me a new sense of confidence."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNZMUxheml3RRAB",
      "name": "Gizem Comert",
      "score": 5.0,
      "comment": "I had a truly exceptional experience with Dr. Cem BAYSAL and her team. From the moment I walked into the clinic, I felt welcomed and at ease. Dr. Cem is not only incredibly skilled and professional, but also extremely gentle and attentive to every detail. You can genuinely tell that she cares deeply about her patients and takes pride in providing the highest standard of care. The entire process was smooth and comfortable, and I felt informed and reassured at every step.\n\nHer assistant was equally wonderful — very kind, attentive, and always checking in to make sure I was comfortable and understood everything that was going on. Their teamwork is seamless and creates such a calming and reassuring environment. It’s rare to find a clinic where both the dentist and assistant are so compassionate, detail-oriented, and committed to excellence. I can’t recommend them highly enough!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUNvei1YSUx3EAE",
      "name": "Anelia Aldinova",
      "score": 5.0,
      "comment": "This is the first time I make a review here, just because I definitely think he deserves it to the bottom. Dear Dr. Cem is one of his kind, both professionally and personally. For as long as I know, I had a fear with the dentists (phobia to be exect) which caused me to delay my dental treatment for many years. Then at the age of 42 and many missing teeth, and many decays later I said enough and started to search for an expert. I'm from Bulgaria, changing places due to my work worldwide. When I discovered Dr. Cem, read his many good reviews, I knew he was the one. I booked a consultation, we talked and his expertise, his calming voice, excellent English and communication made me assure I was at the right place. The rest is history. I'm so glad with all the implants he did for my missing tooth and can't wait to go back for my full crowns, which you can see many excellent examples of, at his Instagram page. Another important point is, how impeccable and spotless his clinic is and he has an excellent team of assistants, especially his receptionist whom I've been always in contact with about all the appointments and everything. You have a great team Dr. Cem, coming back soon! Love you all"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNZMUo2aWp3RRAB",
      "name": "Burcu",
      "score": 5.0,
      "comment": "I had an excellent experience with Dr. Cem BAYSAL. He is truly a talented and highly skilled dentist. I had a dental prosthesis done, and he used only the best quality adhesives and materials throughout the process. Even though I currently live abroad, I have never had any issues with my prosthesis coming loose or falling out—it has remained perfectly secure and comfortable from day one.\n\nHis attention to detail, professionalism, and dedication to providing top-tier care really stood out.He took the time to explain every step clearly and made sure I was comfortable and informed throughout the entire procedure.\n\nI am extremely satisfied with the results and grateful to have found such a reliable and caring professional. I highly recommend Dr. Cem BAYSAL to anyone looking for outstanding dental care. He is truly one of the best!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUNndFlMb2JnEAE",
      "name": "Lee Ramsey",
      "score": 5.0,
      "comment": "After a lifetime of horrendous dental situations and dentists, in many countries, where i can only assume they made deals with the devil, I came to Istanbul to take one last shot at not only repairing my teeth, but to obliterate my fear and boost my self esteem.  With 3 potential  clinics in view to compare treatments,  philosophies, and costing.... Professor Cem was my first call. His consulting assessment,  personal charisma, and thoroughly paced explanations were an immediate tick in all boxes.  So much so that after leaving the assessment session, I took a stroll through the city for an hour on my way to my other planned assessments. During a brief coffee stop, an overwhelming notion hit me that I will most likely not receive such a welcome and calming influence as I had just experienced.  It was truly profound. Therefore, I made an immediate U-turn straight back to Professor Cem's clinic and wonderful team to make my commitment to go forward with my treatments.  Upon the first day of treatment, the reassurances, relaxed atmosphere, and comforting humour and banter within the entire team was incredible. Any nervous energy i carried into the clinic that day literally evaporated.  I had 3 sessions in total for phase 1 of my schedule.  Days 2 and 3 were just so easy.  End of day 3, I was a little overwhelmed by the renewed  and fearless patient I became, and all is due to Cem and his clinical team. In total, I had 2 extractions, a temporary bridge, and 8 implants. I must, in all good conscience, recommend no other clinic for such work, and I eagerly await my return to complete this positive transformation i desperately needed.  Sincere thanks and big love to you all guys from my heart ❤️."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTURRLWVEVUhnEAE",
      "name": "Denny Akhtar",
      "score": 5.0,
      "comment": "I travelled with a friend to Istanbul and we both had dental work completed to a high standard a few years ago with Dr Baysal. When I had a tooth removed last week I did not hesitate and have booked in again. Hopefully see Dr Baysal in June 2025 for what no doubt will be a successful tooth replacement."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3JIaDRBRRAB",
      "name": "Shahram Shirzad",
      "score": 1.0,
      "comment": "Awful experience!!! BE CAREFUL!!!\n\nIt all looked nice (at the beginning), unfortunately shortly after the treatment started ongoing problems. The crowns inserted are too big (this is now confirmed by 3 different dentists) and because of so big and badly fitted crowns I'm having ongoing gums inflammation.\n\nMoreover, a few months ago 2 crowns suddenly broke (during me eating cooked, soft potatoes with some other cooked vegetables), it all looks everything but not a good quality Zirconia crowns. They shouldn't break like this."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSURmbXNUOWpRRRAB",
      "name": "Robert Davenport",
      "score": 5.0,
      "comment": "I’ve been using Dr Cem Bysal since 2017.\nI’m not exaggerating, he is the best dentist in turkey 🇹🇷 by far.\n\nI’ve had other friends use cheaper dentists in turkey and they have had noting but trouble.\n(So I guess you get what you pay for)\n\nUnfortunately I grind my teeth at night so have had to go back for more work. I’ve had 24 crowns. 3 implants. The laboratory which make the teeth at AAA*.\n\nIf you try to save a 💵 you will end up regretting it.\nHe speaks perfect English, the minute I entered his surgery I felt comfortable. He also teaches in a university so he’s actively keeping up the good work.\nMy dentist for life. From Manchester England."
    }
  ]
}
