{
  "place_info": {
    "title": "Swissmed Group",
    "address": "Küçükbakkalköy, Fırın Cd. No:29, 34750 Ataşehir/İstanbul, Türkiye",
    "rating": 4.8,
    "reviews": 201,
    "type": "Wellness center"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNfNTdtbHd3RRAB",
      "name": "Giovanni Deluca",
      "score": 5,
      "comment": "Utterly recommend,\nProfessional, friendly staff, able to work under pressure and limited time.\nSpecial thanks to Doctor Gulsen Aygun\nSo efficient and precise.\nI had the job done for less than one third of the price in London!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNGeWVHTUJnEAE",
      "name": "A.j",
      "score": 5,
      "comment": "There’s no better place for your smile to comeback to your daily routine, the place is superbly clean. Starting from the receptionist well mannered, to the security personnel you will feel at home. The dentist are very professional and accurate to the minimum details, the best you can ever find. I was fortunate enough to be cared by Kürşat, very attentive, and always on the go, as well as Sedef , easy approachable Director. So I would recommend this place for the best of Healthier teeth you could ever ask for."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUQxeDdqZDdnRRAB",
      "name": "Pamela Gordon",
      "score": 5,
      "comment": "A friend recommended Swissmed Dental for the treatment I wanted. A whole mouth over-haul so to speak. From covering my mouth every time I laugh I wanted that confidence back in my mouth and my smile.  The 1st port of call after my online request was a phone from Kursat.  He was my consultant who has seen me through from my 1st phone call to the very end of my first stage.  When he asked what I would like and we discussed options available.  I had every bit of confidence that Swissmed Dental would do what it says on the tin excuse the pun. He reassured me  that all would be well and I would be taken care off.  He dispelled all of my fears and anxieties after all this is my mouth, my teeth a very important step/decisions to be made.  Transfers and hotel are part of the package😊.  On arriving at Swissmed I automatically felt at ease.  The layout was inviting and welcoming the artwork straight away made me feel comfortable, not that I was there for the art but the whole place had a holistic, positive safe feeling.  The hygiene levels are extremely high, the equipment is state of the art dentistry. All the staff at Swissmed made my time with them enjoyable and comfortable.  I would like to thank first of all Kursat you are a ⭐️ in the Swissmed camp. Also the Receptionist’s, Dr’s, Assistant’s, Dentists, General Managers, Accounts Dept, Cafe Staff, Security…… Gamze, Sevgi, Guntas, Pelin, Kepenekci, Ertan, Cetin, The 3 Elif’s, Olcay, Eda, Sanir, Dr Asli, Can and Canel  where friendly, caring, polite, patient, professional with the human touch💐. Whoever the architecture and interior designer are they had the clients interests at the top of the list. There are several floors there 3 for dentistry, 1 hair transplants, 1 gym for clients, 1 gym for staff.  I enjoyed using the gym before and after appointments.  Even when you lie down in the chair you are looking up at a lovely piece of art to relax you and take your mind of what is happening in your mouth.  Nice touch🤚🏾. My treatment, I had implants and extractions over the course of 2 days.  They were inserted with precision and care and I was told what was happening.  Then I had dentures made up for me which I will wear for 4 months until I get the veneers put on.  I wasn’t happy with my dentures and Swissmed (Kursat) made sure ✔️ I was happy and they were made to my liking.  My dents look fabulous I am so happy I look forward to my 2nd stage of treatment.  I’m not one for writing reviews but these guys run a tight ship you are valued and cared for to a high degree.  I would shout it from the roof tops.  GET YOUR TEETH DONE AT SWISSMED DENTAL THEY’RE BRILLLLIANT.  Love you all see you soon 😁😘"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSUNUNXJtSGFBEAE",
      "name": "Hani Osman",
      "score": 5,
      "comment": "I attended Swiss Med, my co ordinator Umut was so helpful with staying in contact with me and keeping me updated and the lovely dentist Dilan was so kind and lovely and met all my requests, the receptionist Sema was a friendly face to see when you come in. Would highly recommend to anyone ☺️"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURyM2EtRmRBEAE",
      "name": "S100",
      "score": 5,
      "comment": "The staff was welcoming, the customer service was excellent, and the practitioner was excellent. Moreover, the prices were reasonable. Also the place is super clean."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNUd192MTl3RRAB",
      "name": "Murat Kaya",
      "score": 5,
      "comment": "Great staff, very friendly and welcoming. There is an interesting art gallery at the clinic too."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnSURUdHZDQVNREAE",
      "name": "Mohamed Yassine",
      "score": 5,
      "comment": "Good service, better quality, friendly staff. It was a good experience."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUQzbjllRzZnRRAB",
      "name": "WG HOUSEHOLD UK LTD",
      "score": 5,
      "comment": "Always ask for hassan jaan,"
    }
  ]
}