{
  "info": {
    "name": "Mete Dental polyclinic ",
    "email": "mete20828@gmail.com",
    "phone": "+90 507 747 23 24",
    "address": "Zafer Mah. Yıldırım Beyazıt Cad. No:110/1\nYenibosna Bahçelievler, İSTANBUL.",
    "description": "Mete Dental Clinic: Expertise, innovation, trust, compassion, personalized care, excellence.\n",
    "longDescription": "Delivering Excellence in Patient-Centered Care for Nearly a Decade\n\nMete dental Clinic has been proudly serving patients for over 9.5 years, establishing itself as a trusted name in providing high-quality, comprehensive healthcare. Located at the heart of medical excellence, Metedis specializes in meeting the unique needs of each patient with professionalism, care, and expertise.\n\nOur team of highly qualified professionals includes specialists fluent in English, Somali, and Bulgarian, ensuring seamless communication and personalized care for an international clientele. Whether you're seeking advanced dental treatments, aesthetic procedures, or holistic health services, Mete dental offers tailored solutions designed to achieve optimal outcomes and patient satisfaction.\n\nWith cutting-edge facilities, we incorporate the latest advancements in healthcare technology. Our commitment to hygiene, safety, and excellence ensures a comfortable and reassuring experience for every patient. Additionally,  Mete dental is known for its ethical approach, delivering transparent consultations and recommendations that prioritize patient well-being above all.\n\nWhether you're traveling to Turkey for medical care or you’re a local patient, Metedis Clinic stands out as your reliable partner in health and wellness. Discover why thousands of patients have chosen us over the past decade for treatments that combine expertise, innovation, and compassion.\n\nChoose  Mete dental – A Clinic Built on Trust, Care, and Excellence."
  },
  "images": [
    {
      "id": "1738743757086-3ruf7cd28",
      "filename": "1738743757062-aa47a395-d2a1-4a07-b27e-5a113270cf83.jpeg",
      "originalname": "aa47a395-d2a1-4a07-b27e-5a113270cf83.jpeg"
    }
  ]
}