{
  "place_info": {
    "title": "Nöbetçi Acil Dişçi Bahçelievler | Mete Ağız Ve Diş Sağlığı Polikliniği",
    "address": "Zafer Mahallesi, Yenibosna Merkez, Yıldırım Beyazıt Cd. No:110/1, 34194 Bahçelievler/İstanbul, Türkiye",
    "rating": 4.8,
    "reviews": 90,
    "type": "Dentist"
  },
  "reviews": [
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTURva2ZDY29BRRAB",
      "name": "Jamie Moffat",
      "score": 5.0,
      "comment": "Wow. What an experience. I have had a huge fear of dentists my whole life. Pretty bad experiences since I was a child. So obviously I really neglected my teeth. I was at a point where I was in constant pain and could barely chew. So I knew I needed help and reached out to Mete's international rep Ms. Asia( didnt want to have to take out a huge loan or remortgage my house to afford the work in Canada). Right from my first contact with Ms Asia I knew I was flying across the world to finally fix my mouth. She answered every question(there were many) at anytime I asked(10 hour time difference). My fear of dentists just disappeared. Once I arrived she was there every step of the way. It was amazing. I ended up requiring quite a few implants and the rest fitted with crowns. The dentists were fantastic. They made sure I was comfortable the whole time, always making sure I wasn't in pain, answering any questions I had and explaining the procedures as we went. They really were incredible. The assistants and receptionists were equally as great. What can I say I'm beaming right now. I have a real, beautiful smile now that is life changing. I will update this review with pictures after I come back and get the little work that is still required. I want to thank Mete for giving me back my self confidence and my smile back. Its really hard to put into words how I am feeling. But am I ever smiling. And Miss Asia I cannot thank you enough. You truley are gold."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUNJbzZMNUNREAE",
      "name": "S D",
      "score": 5.0,
      "comment": "They did incredible job. That is life changing. My teeth are just brilliant. Thank you Mete Dental International Istanbul team. Special many thanks for representative Miss Asia. She were super helpful, informative and patient. Especially in my case, because Ive had worst experience with previous clinic. So, I’ve asked many questions to her. Finally, I chose them and didn't regret it. Highly recommend.\nIt’s been about since I’ve done my crown installation treatment. So far so good. Will keep you informed."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUR3dlpqVjBRRRAB",
      "name": "Aka",
      "score": 5.0,
      "comment": "I recently had a dental implants procedure done by Doctor Irfan, and I can't recommend him enough! From the initial consultation to the final result, Doctor was professional, knowledgeable, and incredibly caring. He took the time to explain the entire process, which made me feel comfortable and informed.\n\nThe follow-up care was also excellent, with Doctor checking in to make sure everything was healing well.\n\nI’m thrilled with the results of my implant; it looks and feels natural. If you’re considering dental implants, I highly recommend Doctor for his skill and dedication to patient care!"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUNnZzVITk9REAE",
      "name": "Yana Latorre",
      "score": 5.0,
      "comment": "The best clinic in Istanbul! I have never experienced anything close to it in Canada! They helped with a dental and emergency, fixed Canadian implants that our dentist couldn’t fix, all at a fraction of a cost I would pay in Canada. This is the best dental office with an incredible dentist who worked until midnight to make sure I caught my flight in time! Beyond thankful to everyone here!"
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnSUNfbXFIR2lnRRAB",
      "name": "Mila",
      "score": 1.0,
      "comment": "Well, you lying that you don't know who I am, but calling me after seeing my comment, and sending bunch of threatening messages to delete my comment is funny.\nI am not removing the review, that's my personal view of your staff's attitude and treatment.\nWhen I accepted implants that your oral surgeon wanted to convince me are necessary, she wanted to put the most expensive ones.\nWhen I said that I wanted the cheaper option as she said there is almost no difference between them, she refused to treat me.\nAlso, I came in with a broken tooth that needed to be removed and I was in pain, and you refused, and literally told me to leave, when I politely declined taking out other teeth unnecessarily and putting the most expensive implants in their place.\nReview is well deserved.\nI am sure that you would have many more negative ones if you are not threatening to customers to remove them."
    },
    {
      "id": "ChdDSUhNMG9nS0VJQ0FnTUNJak9TcmlBRRAB",
      "name": "Sheila Mastrofrancesco",
      "score": 5.0,
      "comment": "The most amazing experience I have ever had in the medical field . These people are so caring and kind and not only that but they are extremely professional . The doctor is a 10 on a scale from 1 to 10 and his assistant is phenomenal!!! They work great as a team together . This was just my first visit . I will update you on my final results with before and after pictures on my second visit . I will also be creating a Tik Tok so you can experience what I have experienced in the 2nd round in 6 weeks ."
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTURnbU1iRE1nEAE",
      "name": "roel zuidam",
      "score": 5.0,
      "comment": "I had a complete treatment here and i am satisfied with the new teeth and the way it is done. Also the hotel what they arranged was verry good with great breakfast and sauna and swimming pool . The only thing what i found a bit disturbing was that dentist did not speak good englisch, altouch there was someone who did the transilation gr from Roel the Netherlands"
    },
    {
      "id": "ChZDSUhNMG9nS0VJQ0FnTUR3cS1pR2JREAE",
      "name": "Olena Osypenko",
      "score": 5.0,
      "comment": "Excellent experience with Mete Dental Clinic - got Hollywood smile fast and on a budget, wonderful team that works hard to make sure clients are happy. Many thanks from Canada!!!"
    }
  ]
}
